{
  "sample_data":
  [
    {"post_id": "201", "response_id": "347", "text": "XXXX XXXXXX, owner of St. XXXXX XXXXX in Florida, shares a Quick Tip of converting the SLS Scorecard into individualized reports for all of her drivers. Check out the example scorecard below to see how you might apply this to your business.\n\nWATCH:\nhttps://d2war8rj8bm5io.cloudfront.net/original/1X/500ce81681d904f4e212f7b3570bbb064931005e.mp4 \nLISTEN:\nhttps://d2war8rj8bm5io.cloudfront.net/original/1X/a7dbef236bdd59b06e0c19bd903345de63d4de7d.m4a \nEXAMPLE:\n![Scorecard%20Example|714x500](upload://fYA4HbrlOK8DdL1svKPSSea2Hg3.png) \n\nTag your \"performance\" tools, tips and tricks in the Driver Engagement Topic section to see what ideas other owners may have to share with you!", "post_number": "1"},
    {"post_id": "201", "response_id": "531", "text": "This is great XXXX! Thanks for sharing. Have you found a way to automate the data entry from the Amazon reports into your individualized driver scorecard? As well, what time period are you using for attendance metrics?", "post_number": "2"},
    {"post_id": "201", "response_id": "597", "text": "Hi XXXXX- I  have not figured out a way to automate the initial entry yet.  We're pulling hours out of ADP, FICO scores out of Mentor and then metrics off the portal so it's a bit time consuming. We mirror the Amazon weeks so Sunday- Saturday.  We email schedules out the week before on Wednesdays so each Driver has their schedule along with their metrics for the prior week.", "post_number": "3"},
    {"post_id": "201", "response_id": "3318", "text": "XXXXX we do something like this with teams.  There's away to export the scorecard data to an excel and use lookup tables to assign that data to your drivers.  It would probably save you a ton of time.  I'd be happy to set up a call and show you.  Let me know!", "post_number": "4"},
    {"post_id": "201", "response_id": "10114", "text": "@XXXXXXXX Hey XXXXXXX, would love to learn this from you! Let me know what time might work for you in the coming week?", "post_number": "5"},
    {"post_id": "201", "response_id": "12591", "text": "@XXXXXXXX i would like to know more about how you export this in excel.", "post_number": "6"},
    {"post_id": "201", "response_id": "16097", "text": "@XXXXXXXX So cool - how do you export scorecard info to excel?!", "post_number": "7"},
    {"post_id": "201", "response_id": "17351", "text": "Hi,\nNewbie here in San Diego.\nCan you tell me where to find the reports for this?\nThanks,\nXXXXXX\nXXXX DSD3", "post_number": "8"},
    {"post_id": "202", "response_id": "348", "text": "XXXXX XXXXXX, owner of XXXXXXX out of DCS1, shares why he focuses on commitment, accountability and respect as part of his recruitment efforts to develop the culture he wants to foster across his team. \n\nWATCH:\nhttps://assets-ignitestg-agc-prod-us.s3.dualstack.us-west-2.amazonaws.com/original/1X/44cbec1935f4a3c93de3533c2b85bd275490b174.mp4 \nLISTEN:\nhttps://d2war8rj8bm5io.cloudfront.net/original/1X/a898b1a780a039c1c4988f1643f172bc9d2675da.m4a \n\nUse the tag \"recruiting\" to share your tips on what you suggest looking for as you recruit.\n\n![14%20AM|724x480](upload://bESmkamNqYI2YHvAsuYFKugYfFu.png)", "post_number": "1"},
    {"post_id": "212", "response_id": "53358", "text": "I am launching on 9/15 and have been working on an 'Expectation' package.  XXXXXX's information would also be very helpful.  Are there documents on both topics that you can share?  XXXXXXX@gmail.com", "post_number": "2"},
    {"post_id": "212", "response_id": "63745", "text": "Love the idea of a welcome packet.  How can I get a copy of your PDF?  XXXXXX@XXXXXXX.com", "post_number": "3"},
    {"post_id": "212", "response_id": "85616", "text": "@XXXXXXXX Thank you for the valuable information. Where do I go to access the PDF?", "post_number": "4"},
    {"post_id": "214", "response_id": "360", "text": "https://d2war8rj8bm5io.cloudfront.net/original/1X/598339add692aada0236f94a74fd3b175c704dc1.mp4 \n\nThought I'd take just a few moments to talk about recruiting and driver engagement. When I think about the ideal driver profile and specific experiences or skills I look for, we’re looking at things like their attitude during an interview, their engagement with me during the interview, whether or not are they paying attention. Does it seem like they're very interested at all? It’s made me pretty successful in finding drivers who have higher retention and tend to do their jobs better. Beyond that, I do look at work history, how frequently they've jumped jobs, so to speak. And then quite frankly, at the end, I also look for physical fitness because that's a big driver of success.\n\nWhen I think about how my job postings stand out, there was really three things that have helped me. Number one: a well written job description. It seems pretty straightforward, but if you search descriptions out there, grammar and spelling make a big difference in professionalism. Mine is well-written and concise, but detailed enough and the most important things are first and the lesser important things are later to capture the candidates’ attention. We respond to candidates very quickly. I have a score on the recruiting website that says I'm a very responsive employer. I think that attracts attention.\n\nHonestly, the biggest piece is you've got to be willing to pay for it. It's search marketing. If you're not willing to pay, you're not going to show up. In a tight job market, the first postings on the first page are the ones that they're going to pay the most attention to. Frequently, they won't even get to the second page. If they see a job they're interested in with a pay rate they would want and it's on the first page, there's no need to go further. Willingness to pay for a high listing with your recruiting provider I think is probably number one.\n\nFinally, some red flags for problem candidates and how I identify those flags. Punctuality comes to mind. If somebody is wants to be a DA for me, it's like any other job. If you're not on time, and if you can't call ahead or text ahead, you likely are not going to get the job. That's big for me. And then as I said earlier, attitude and engagement during the interview. I've been really surprised with this particular employee pool when I contrast it to my own experience in my old world. It's definitely a challenging employee pool and some people are doing interviews for the sake of doing interviews and frankly don't care about whether or not they get the job. To me, you see that pretty quickly in their punctuality, how they engage with you when they meet you, and their attitude when they sit down across from you. That's pretty easy to see even in a 15 minute interview. For me, questionable attitude, marginal punctuality, and limited engagement are huge red flags. I won't continue interview at that point.", "post_number": "1"},
    {"post_id": "214", "response_id": "7320", "text": "This is excellent!  Thanks for sharing.", "post_number": "2"},
    {"post_id": "214", "response_id": "7332", "text": "Good insights.   We have been hiring drivers so long in our careers we some times miss the simple stuff. \n\nHiring a AMZL DA is very different from hiring a FEDEX driver, office products driver or wholesale pharma driver.  \n\nSometimes we as a company forget that.", "post_number": "3"},
    {"post_id": "214", "response_id": "7335", "text": "Great to see we are already on this page.  We do a lot of the things you've highlighted!\n\nThanks for the info @XXXXX", "post_number": "4"},
    {"post_id": "247", "response_id": "393", "text": "\nhttps://d2war8rj8bm5io.cloudfront.net/original/1X/b29bce3e86511d210531447a1a39e05edd7b595f.mp4 \n\n\nI thought I'd take just a couple of minutes to talk about why I got into this whole DSP thing.\n\nI'm going to be very frank and honest here. I spent 18 years in a corporate management consulting role and spent a lot of time with teams building PowerPoints and spreadsheets in board rooms. That was all good and fun, and I got a lot of financial success out of it. But after 18 years, it burned me out. I was at a bit of a crossroads about a year ago, was never the entrepreneurial type, and I took this on on a whim. I have to tell you, I don't know if I could ever go back. There is something about running your own business that is so much more fulfilling than what I was doing in the past.\n\nI think there's a sort of odd, simple pleasure of delivering packages. I've been ordering online for years and there is still a bit of joy and glee when my packages arrive. I know it's rather simple, but I don't know if there's much more “real” in a corporate board room versus delivering packages and getting stuff to people's door. I think the sense of fulfillment I get from running a DSP is I get to finally take all these ideas I've always talked about and I get to implement them. I get to execute 100% of them. And sometimes I fail, and sometimes I don't. I don't know if there's anything from a job or career standpoint that's more fulfilling than that.", "post_number": "1"},
    {"post_id": "247", "response_id": "11396", "text": "Couldn't agree more!", "post_number": "2"},
    {"post_id": "247", "response_id": "11403", "text": "Thanks for sharing your story @XXXXXX. You realize you have been in this for almost 1.5 year now, not just 10 months? Looks like time is passing too fast! :slight_smile:", "post_number": "3"},
    {"post_id": "247", "response_id": "11404", "text": "@XXXXX Yes. I posted that for the moderators during the pilot phase of this app. I think occasionally they bring back some of the original relevant posts.", "post_number": "4"},
    {"post_id": "247", "response_id": "11405", "text": "@XXXXX ah alright. great to hear your thoughts and decision making process in making this leap. Thank you! :v:", "post_number": "5"},
    {"post_id": "247", "response_id": "11517", "text": "Really like the post.  Well said.", "post_number": "7"},
    {"post_id": "302", "response_id": "523", "text": "How is everyone handling issuing uniforms? Are you waiting a few weeks to issue them out to see if they make it or just giving them out immediately?", "post_number": "1"},
    {"post_id": "302", "response_id": "1826", "text": "I noticed there wasn’t much of a response on your post - maybe it’s worth a repost since more DSPs have joined in the last couple of weeks??\n\nI’ll say as someone who has 60 DAs and climbing, this is a big hit and it’s disappointing the way it’s been handled. Specifically, the short cut over date and the threat that drivers won’t be able to load out.\n\nI’ll preempt the response that it’s a safety issue - I actually agree with this logic! Having uniforms is a good thing and will promote safer working conditions. However, the reasoning is not justification for the implementation.m strategy.\n\nSome sort of stipend should have been given. Saying “it’s baked into the rate card” is something I think every DSP owner is frankly tired of hearing. I don’t see it - can we get a breakdown to see where it’s baked in?\n\nNow all that said :) I do want to keep it positive and answer your question - I have been slow rolling the ordering; starting with minimal shirts and shorts- trying to space it out with when I receive payments from amazon. To take an all at once hit for the entire company would put us at a financial risk. We are just one month old!!\n\nIt would have been nice to have a phased implementation- starting with everyone gets shirts, then a few weeks or month later, get bottoms, then multiple sets. \n\nI think this underscores the need for this forum; so we can mutually communicate both sides of issues.\n\nI haven’t done a search, but has the dress code of seasonal drivers been nailed down?\n\nKind regards,\nXXXXXX", "post_number": "2"},
    {"post_id": "302", "response_id": "1831", "text": "I provide new drivers with a shirt and hat initially, if they make the cut their issued the rest of the uniforms.  If they don’t make the cut, I have them turn in the shirt.", "post_number": "3"},
    {"post_id": "302", "response_id": "2000", "text": "Do you happen to have a contact to get uniforms. I cannot gain access to sunriseid.com site. I'm told uniforms are on backorder.", "post_number": "4"},
    {"post_id": "302", "response_id": "2023", "text": "XXXXXX - XXXXXX@XXXXXX.com\n\nThey have plenty in stock.", "post_number": "5"},
    {"post_id": "302", "response_id": "2024", "text": "Peak Uniform Policy - only one top required and can be amazon branded vest. Applies to both permanent and seasonal. \n\nAfter Peak Uniform Policy - one top and one bottom; top cannot only be vest. \n\nThat’s from the Peak Playbook that AMZL uses.", "post_number": "6"},
    {"post_id": "302", "response_id": "2099", "text": "Thank You XXXXXXX!", "post_number": "7"},
    {"post_id": "302", "response_id": "2102", "text": "Everything I've been seeing says branded 4 shirts and 2 bottoms. Not sure where peak versus non-peak uniform issues comes in at?", "post_number": "8"},    
    {"post_id": "313", "response_id": "536",  "text":"![image|274x500](upload://ta99kquIRJlg1kZTLr4Ssy6o7hK.jpeg)", "post_number":"1"},
    {"post_id": "313", "response_id": "555", "text": "That is not a bad price. Always good to have on hand for those angry dogs!", "post_number": "2"},
    {"post_id": "632", "response_id": "1068","text": "Good morning Team since we are implementing the new system to help with load out, will this eliminate our DA’s from having to scan to verify, this process does take more time from our under the roof time, because the toes sometimes are not in order of the DA’s pick list i.e. route plan.  Training the load out team to stack toes in sequence of pick list/ route plan. We are always better together.", "post_number":"1"}
  ]
}